app/views/articles/home.html.erb

        <% end %>
        <h5 class="date"><%= article.created_at.strftime("%d %B %Y %-H:%M") %> * <%= article.comments.count %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]