app/controllers/articles_controller.rb

  def index
    @articles = Article.all.order('created_at DESC')
---
SELECT "articles".* FROM "articles" ORDER BY created_at DESC

  def home
    @articles = Article.all.order('created_at DESC').limit(10)
---
SELECT  "articles".* FROM "articles" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 10]]

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("headline", "lead", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "lead" = $1, "updated_at" = $2 WHERE "articles"."id" = $3