app/controllers/comments_controller.rb

	def create
		@article = Article.find(params[:article_id])
		@comment = @article.comments.create(params[:comment].permit(:author, :content))
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("author", "content", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "Carlos"], ["content", "Hello"], ["article_id", 1], ["created_at", 2017-03-15 00:47:18 UTC], ["updated_at", 2017-03-15 00:47:18 UTC]]